
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Ссылка	= ПараметрКоманды;	
	Диалог	= новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.МножественныйВыбор 	= Ложь;
	Диалог.Фильтр 				= НСтр("ru = 'Документ'; en = 'Document'") + " XML (*.xml)|*.xml";
  	Диалог.Заголовок 			= НСтр("ru = 'Укажите путь и имя для сохранения'; en = 'Specify the path and name to save'");
	
	Оповещение = новый ОписаниеОповещения("ОповещениеПослеВыбораФайлаДляЧтения", ЭтотОбъект, Ссылка);	 
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораФайлаДляЧтения(ВыбранныеФайлы, Ссылка)Экспорт
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив")	Тогда
		ОписаниеФайла 		= новый ОписаниеПередаваемогоФайла();
		ОписаниеФайла.Имя 	= ВыбранныеФайлы[0];
		ПомещаемыеФайлы 	= новый Массив;
		ПомещаемыеФайлы.Добавить(ОписаниеФайла);
		Оповещение 			= новый ОписаниеОповещения("ОповещениеПрочитатьФайл", ЭтотОбъект);		
		НачатьПомещениеФайлов(Оповещение, ПомещаемыеФайлы,, Ложь, Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПрочитатьФайл(ПомещенныеФайлы, ЭтотОбъект)Экспорт

	ИнфСообщение = ОбщийОписаниеОшибокНаКлиенте.текстОшибкиВыгрузкиЭлементаВФайл();

	Если ТипЗнч(ПомещенныеФайлы) = Тип("Массив") Тогда
		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ПомещенныеФайлы[0].ПолноеИмя);
		ДанныеXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение);		
		
		ДанныеСтруктура = ОбщегоНазначенияСервер.ПолучитьСтруктуруСправочникаПроизведения();
		ЗаполнитьЗначенияСвойств(ДанныеСтруктура, ДанныеXDTO);
		
		Для каждого СтрДанных Из ДанныеXDTO.ТЧТело.Row Цикл
			
			ОписаниеСтрокиТЧ = Новый Структура;
			ОписаниеСтрокиТЧ.Вставить("СтрокаДанных");
			ОписаниеСтрокиТЧ.Вставить("Подсказка");
			ЗаполнитьЗначенияСвойств(ОписаниеСтрокиТЧ, СтрДанных);
			ДанныеСтруктура.Тело.Добавить(ОписаниеСтрокиТЧ);			
		
		КонецЦикла;
		
		Если ДанныеXDTO.СодержитКартинку Тогда
			АдресКартинки = ПоместитьВоВременноеХранилище(ДанныеXDTO.ВизуализацияКартинка);
			ДанныеСтруктура.АдресКартинки = АдресКартинки;
		КонецЕсли;
		
		СоздатьЭлементыНаОсновеДанныхФайлаXML(ДанныеСтруктура);
		
		ИнфСообщение = НСтр("ru = 'Загрузка выполнена!'; en = 'Download done!'");
	КонецЕсли;
	
	Сообщить(ИнфСообщение);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыНаОсновеДанныхФайлаXML(ДанныеСтруктура)
	
	ПроизведениеСсылка = Справочники.Произведения.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ПроизведениеСсылка, ДанныеСтруктура);
	
	Если ДанныеСтруктура.СодержитКартинку Тогда
		АдресКартинки 			= ПолучитьИзВременногоХранилища(ДанныеСтруктура.АдресКартинки);
		КартинкаСсылка 			= Справочники.Картинки.СоздатьЭлемент();		
		КартинкаСсылка.Данные 	= Новый ХранилищеЗначения(АдресКартинки);
		
		//КартинкаСсылка.Записать();
		ПроизведениеСсылка.Визуализация = КартинкаСсылка;
	КонецЕсли;
	
	Для каждого СтрТЧ Из ДанныеСтруктура.Тело Цикл
	
		НоваяСтрТЧ = ПроизведениеСсылка.Тело.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрТЧ, СтрТЧ);
	
	КонецЦикла;
	
	// ПроизведениеСсылка.Записать();

КонецПроцедуры