
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Ссылка	= ПараметрКоманды;
	
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр 		= НСтр("ru = 'Документ'; en = 'Document'") + " XML (*.xml)|*.xml";
  	Диалог.Заголовок 	= НСтр("ru = 'Укажите путь и имя для сохранения'; en = 'Specify the path and name to save'");
	
	Оповещение = новый ОписаниеОповещения("ОповещениеПослеВыбораФайлаДляЧтения", ЭтотОбъект, Ссылка);	 
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораФайлаДляЧтения(ВыбранныеФайлы, ДопПараметры)Экспорт
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив")	Тогда
		ОписаниеФайла = новый ОписаниеПередаваемогоФайла();
		ОписаниеФайла.Имя = ВыбранныеФайлы[0];
		ПомещаемыеФайлы = новый Массив;
		ПомещаемыеФайлы.Добавить(ОписаниеФайла);
		Оповещение = новый ОписаниеОповещения("ОповещениеПомещениеФайла", ЭтотОбъект, ДопПараметры);		
		НачатьПомещениеФайлов(Оповещение, ПомещаемыеФайлы,, Ложь, ДопПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПомещениеФайла(ПомещенныеФайлы, ДопПараметры)Экспорт
	Если ТипЗнч(ПомещенныеФайлы) = Тип("Массив") Тогда
		СсылкаСозданного = ОбработкаПереданногоФайлаНаСервере(ПомещенныеФайлы[0].Хранение, ДопПараметры);
	КонецЕсли; 	
КонецПроцедуры

&НаСервере 
Функция ОбработкаПереданногоФайлаНаСервере(Знач АдресХранилища, Знач Ссылка)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);	
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();	
	Файл = новый ЧтениеXML;
	Файл.ОткрытьПоток(Поток);
	
	Пока Файл.Прочитать() Цикл
		имяРеквизита = Неопределено;
		знчРеквизита = Неопределено;
		
		// Проверить тип узла.		
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда		
			
			// Прочитать атрибуты.			
			Пока Файл.ПрочитатьАтрибут() Цикл				
				имяРеквизита = Файл.Значение;			
			КонецЦикла;			
		КонецЕсли;    		
				
		Если Файл.ТипУзла = ТипУзлаXML.Текст Тогда			
			знчРеквизита = Файл.Значение;
		КонецЕсли;    				
		
		Если Файл.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда			
			//Сообщение.Текст = "/" + Файл.Имя;
			//Сообщение.Сообщить();			
		КонецЕсли; 
		
	КонецЦикла;	
	
	Файл.Закрыть();	
	Поток.Закрыть();	
	
	Возврат Ссылка;
	
КонецФункции 