
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьСловоВНабор(0, 1, "ТестовоеСлово1");
	ДобавитьСловоВНабор(0, 2, "ТестовоеСлово2");
	ДобавитьСловоВНабор(0, 3, "ТестовоеСлово3");
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

// Функция - Получить описание слова
// ВНИМАНИЕ - возврат НЕОПРЕДЕЛЕНО Если не корректно составленно имя команды!
//
// Параметры:
//  Команда	 - КомандаФормы - Строка где разделитель "_", Индек:
//	0 - Строка - ИмяКоманды
//	1 - Число  - Индекс строки произведения
//	2 - Число  - Индекс слова в строке
//	3 - Строка - Слово
// 
// Возвращаемое значение:
//  ОписаниеСлова - Структура:
//	ИмяКоманды 		- Строка
//	ИндексСтроки 	- Число
//	ИндексСлова 	- Число
//	Слово 			- Строка	
//
&НаКлиенте
Функция ПолучитьОписаниеСлова(Команда)

	ОписанияСлова = Новый Структура;
	ОписанияСлова.Вставить("ИмяКоманды");
	ОписанияСлова.Вставить("ИндексСтроки");
	ОписанияСлова.Вставить("ИндексСлова");
	ОписанияСлова.Вставить("Слово");
	
    мИзЗаголовкаКоманды = СтрРазделить(Команда.Имя, "_");
	Если мИзЗаголовкаКоманды.Количество() <> 4 Тогда	
		Возврат Неопределено;	
	КонецЕсли;
	
	ОписанияСлова.ИмяКоманды 	= мИзЗаголовкаКоманды[0];
	ОписанияСлова.ИндексСтроки	= мИзЗаголовкаКоманды[1];
	ОписанияСлова.ИндексСлова   = мИзЗаголовкаКоманды[2];
	ОписанияСлова.Слово			= мИзЗаголовкаКоманды[3];
	
	Возврат ОписанияСлова;

КонецФункции // Полу()


&НаКлиенте
Процедура СловоВыбрано(Команда)
	
	ОписанияСлова = ПолучитьОписаниеСлова(Команда);
	
	Если ОписанияСлова = Неопределено Тогда	
		Сообщить("Ошибка расшифровки слова!"); // добавить eng
		Возврат;
	КонецЕсли;
	
	Сообщить(ОписанияСлова.Слово);
	
	
	ЭлементСлово = ЭтаФорма.Элементы[Команда.Имя];	
	ЭлементСлово.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСловоВНабор(ИндексСтроки, ИндексСлова, Слово)
	
	ЗаголовокКоманды		= Слово;
	РодительКоманды 		= ЭтаФорма.Элементы.ГруппаСлова;
	ТекущееКоличествоКоманд	= ЭтаФорма.Элементы.ГруппаСлова.ПодчиненныеЭлементы.Количество();
	ИмяКоманды				= СтрШаблон("КомандаСловоВыбрано%1_%2_%3_%4", 
								ТекущееКоличествоКоманд, ИндексСтроки, ИндексСлова, СтрЗаменить(Слово, " ", ""));
	
	НоваяКоманда 			= Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Действие 	= "СловоВыбрано"; // Имя процедуры
	НоваяКоманда.Заголовок 	= ЗаголовокКоманды;
	
	НовыйЭлемент 			= Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), РодительКоманды);
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры