  #Область ПоказатьТекущуюКартинку

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Данные");

КонецПроцедуры

#КонецОбласти

#Область СохранениеКартинку

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		ТекущийОбъект.Данные	= Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЗагрузитьКартинку

&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)

	Оповещение = Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;

	Объект.ДатаЗагрузки = ТекущаяДата();
	АдресКартинки		= Адрес;
	Модифицированность	= Истина;

КонецПроцедуры

#КонецОбласти