
&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	Объект.Тело.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВТЧ(Команда)
	
	ДанныеДляНаполненияТЧ = ЭтаФорма.ТекстДляЗаполнения;
	Если НЕ ЗначениеЗаполнено(ДанныеДляНаполненияТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	ИндексКолонки 	= ЭтаФорма.КакуюКолонкуОбработать;
	РежимНаполнения	= ЭтаФорма.РежимНаполнения;
	ИмяРеквизита 	= ПолучитьИмяРеквизитаДляРедактирования(ИндексКолонки);
	
	мДанных = СтрРазделить(ДанныеДляНаполненияТЧ, Символы.ПС, ЛОЖЬ);
	
	Если НЕ РежимНаполнения Тогда
		
		Для каждого СтрокаДанных Из мДанных Цикл			
			Если НЕ ЗначениеЗаполнено(СтрокаДанных) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Объект.Тело.Добавить();
			НоваяСтрока[ИмяРеквизита] = СтрокаДанных;			
		КонецЦикла;
		
	Иначе
		
		ИтераторВходныхДанных 	= 0;
		ИтераторВыходныхДанных 	= 0;
		Пока ИтераторВыходныхДанных < Объект.Тело.Количество() Цикл
			Если ИтераторВходныхДанных > мДанных.Количество() Тогда
				Прервать;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(мДанных[ИтераторВходныхДанных]) Тогда
				ИтераторВходныхДанных = ИтераторВходныхДанных 	+ 1;
				Продолжить;
			КонецЕсли;
			
			Объект.Тело[ИтераторВыходныхДанных][ИмяРеквизита] = мДанных[ИтераторВходныхДанных];
			
			ИтераторВходныхДанных 	= ИтераторВходныхДанных 	+ 1;
			ИтераторВыходныхДанных 	= ИтераторВыходныхДанных 	+ 1;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяРеквизитаДляРедактирования(ИндексЭлемента)

	ИмяРеквизита = Новый Массив;
	ИмяРеквизита.Добавить("СтрокаДанных");
	ИмяРеквизита.Добавить("Подсказка");
	
	Возврат ИмяРеквизита[ИндексЭлемента];

КонецФункции // ПолучитьИмяРеквизитаДляРедактирования()

