
&НаКлиенте
Функция текстОшибкиРасшифровкиСлова() Экспорт

	Возврат НСтр(
	"ru = ""Ошибка расшифровки слова!"";
	|en = ""Error word decoding!""
	|");

КонецФункции // текстОшибкиРасшифровкиСлова()

&НаКлиенте
Функция текстОшибкиПроверкиСловаСоответствуютПорядку() Экспорт

	Возврат НСтр(
	"ru = ""Ошибка проверки слова на соответствия порядка следования!"";
	|en = ""Error checking the word for order matches!""
	|");

КонецФункции // текстОшибкиПоискаСловаВВыходныхДанных()

&НаКлиенте
Функция текстОшибкиПроверкаПорядкаСловНеПройдена() Экспорт

	Возврат НСтр(
	"ru = ""Проверка не пройдена, попробуйте еще!"";
	|en = ""Verification failed, try again!""
	|");

КонецФункции // текстОшибкиПоискаСловаВВыходныхДанных()


