
&НаКлиенте
Функция текстОшибкиРасшифровкиСлова() Экспорт

	Возврат НСтр(
	"ru = ""Ошибка расшифровки слова!"";
	|en = ""Error word decoding!""
	|");

КонецФункции // текстОшибкиРасшифровкиСлова()

&НаКлиенте
Функция текстОшибкиПроверкиСловаСоответствуютПорядку() Экспорт

	Возврат НСтр(
	"ru = ""Ошибка проверки слова на соответствия порядка следования!"";
	|en = ""Error checking the word for order matches!""
	|");

КонецФункции // текстОшибкиПроверкиСловаСоответствуютПорядку()

&НаКлиенте
Функция текстОшибкиПроверкаПорядкаСловНеПройдена() Экспорт

	Возврат НСтр(
	"ru = ""Проверка не пройдена, попробуйте еще!"";
	|en = ""Verification failed, try again!""
	|");

КонецФункции // текстОшибкиПроверкаПорядкаСловНеПройдена()

&НаКлиенте
Функция текстОшибкиПолучитьСтрокуПроизведенияПоИндексу() Экспорт

	Возврат НСтр(
	"ru = ""Не удалось получить запрошенную строку по причине индекс за границей массива!"";
	|en = ""The requested string could not be retrieved because the index is outside the array boundary!""
	|");

КонецФункции // текстОшибкиПолучитьСтрокуПроизведенияПоИндексу()

&НаКлиенте
Функция текстОшибкиПолучитьПодсказку() Экспорт

	Возврат НСтр(
	"ru = ""Не удалось получить подсказку!"";
	|en = ""Couldn't catch a hint!""
	|");

КонецФункции // текстОшибкиПолучитьПодсказку()

&НаКлиенте
Функция текстОшибкиВыгрузкиЭлементаВФайл() Экспорт

	Возврат НСтр(
	"ru = ""Загрузка не выполнена!"";
	|en = ""Download failed!""
	|");
	
КонецФункции // текстОшибкиПолучитьПодсказку()



