
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка");
	ПараметрыФормы.Вставить("ТекущаяДата");
	
	ПараметрыФормы.Ссылка		= ПараметрКоманды;
	ПараметрыФормы.ТекущаяДата 	= ТекущаяДата();
	
	ОткрытьФорму("ОбщаяФорма.Пазл",
	ПараметрыФормы,
	ПараметрыВыполненияКоманды.Источник,
	ПараметрыВыполненияКоманды.Уникальность,
	ПараметрыВыполненияКоманды.Окно,
	ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
