
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Адрес	= СоздатьXML(ПараметрКоманды);
	Ссылка	= ПараметрКоманды;
	
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Оповещение = новый ОписаниеОповещения("ОповещениеПослеВыбораФайлаДляЗаписи", ЭтотОбъект, Ссылка);	 
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораФайлаДляЗаписи(ВыбранныеФайлы, ДопПараметры)Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив")	Тогда

		Адрес 				= СоздатьXML(ДопПараметры);		
		двоичныеДанные 		= ПолучитьИзВременногоХранилища(Адрес);
		ПолныйПутьКФайлу 	= ВыбранныеФайлы[0] + ".xml";

		двоичныеДанные.Записать(ПолныйПутьКФайлу);
	КонецЕсли;
	
КонецПроцедуры 


//&НаКлиенте
//Процедура ОповещениеПослеВыбораФайлаДляЧтения(ВыбранныеФайлы, ДопПараметры)Экспорт
//	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив")	Тогда
//		ОписаниеФайла = новый ОписаниеПередаваемогоФайла();
//		ОписаниеФайла.Имя = ВыбранныеФайлы[0];
//		ПомещаемыеФайлы = новый Массив;
//		ПомещаемыеФайлы.Добавить(ОписаниеФайла);
//		Оповещение = новый ОписаниеОповещения("ОповещениеПомещениеФайла", ЭтотОбъект, ДопПараметры);		
//		НачатьПомещениеФайлов(Оповещение, ПомещаемыеФайлы,, Ложь, новый УникальныйИдентификатор());
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ОповещениеПомещениеФайла(ПомещенныеФайлы, ДопПараметры)Экспорт
//	Если ТипЗнч(ПомещенныеФайлы) = Тип("Массив")	Тогда
//		Сообщить("Файл " + ПомещенныеФайлы[0].Имя + " отправлен на сервер");
//		Адрес = СоздатьXML(ДопПараметры);
//		
//		двоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
//		имяФайла	= "123";

//		двоичныеДанные.Записать(ПомещенныеФайлы[0].Имя, ТипФайлаТабличногоДокумента.TXT);
//		
//		// Ссылка = ОбработкаПереданногоФайлаНаСервере(ПомещенныеФайлы[0].Хранение, ДопПараметры);
//		// ЭтаФорма.ОтобразитьИзменениеДанных(Ссылка,ВидИзмененияДанных.Изменение);
//	КонецЕсли; 	
//КонецПроцедуры

//&НаСервереБезКонтекста 
//Функция ОбработкаПереданногоФайлаНаСервере(Знач АдресХранилища, Знач Ссылка)
//	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);	
//	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();	
//	Чтение = новый ЧтениеXML;
//	Чтение.ОткрытьПоток(Поток);
//	Объект = СериализаторXDTO.ПрочитатьXML(Чтение);
//	Если ЗначениеЗаполнено(Ссылка)  Тогда   
//		ОбъектСсылки = Ссылка.ПолучитьОбъект();
//		ЗаполнитьЗначенияСвойств(ОбъектСсылки, Объект, "Наименование");  //Заполняем нужные реквизиты
//		ОбъектСсылки.Записать();  		
//	Иначе
//		Объект.Записать();	
//		Ссылка = Объект.Ссылка;
//	КонецЕсли; 	
//	Чтение.Закрыть();	
//	Поток.Закрыть();	
//	Возврат Ссылка;
//КонецФункции

&НаСервере
Функция СоздатьXML(ПараметрКоманды) Экспорт
	// Получаем имя временного файла 
	Путь = ПолучитьИмяВременногоФайла();
	// Инициализируем класс "ЗаписьXML"
	Запись = Новый ЗаписьXML;
	// Открываем временный файл для записи
	Запись.ОткрытьФайл(Путь, "UTF-8"); 
	// Записываем объявление XML-файла
	Запись.ЗаписатьОбъявлениеXML(); //
	
	// Первый элемент
	Запись.ЗаписатьНачалоЭлемента("Произведения");
	
	
	
	// Атрибут первого элемента с датой формирования файла
	Запись.ЗаписатьАтрибут("generated", Формат(ТекущаяДата(), "ДФ=гггг-ММ-ddThh:mm:ss; ДЛФ=DT"));
	
	// Записываем элемент для каждого документа конфигурации. В текст помещаем имя документа.
	//Для Каждого Док Из Метаданные.Документы Цикл
	//	Запись.ЗаписатьНачалоЭлемента("Документ");       		
	//	Запись.ЗаписатьТекст(Док.Имя);				
	//	Запись.ЗаписатьКонецЭлемента();
	//КонецЦикла;
	
	// Завершаем запись первого элемента
	Запись.ЗаписатьКонецЭлемента();
	
	
	
	// Закрываем файл
	Запись.Закрыть();
	
	// Получаем двоичные данные файла и помещаем их во временное хранилище
	ДвоичныеДанные = Новый ДвоичныеДанные(Путь);
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	
	Возврат Адрес; // Возвращаем адрес файла в хранилище
	
КонецФункции
