
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Адрес	= СоздатьXML(ПараметрКоманды);
	Ссылка	= ПараметрКоманды;
	
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр 		= НСтр("ru = 'Документ'; en = 'Document'") + " XML (*.xml)|*.xml";
  	Диалог.Заголовок 	= НСтр("ru = 'Укажите путь и имя для сохранения'; en = 'Specify the path and name to save'");
	
	Оповещение = новый ОписаниеОповещения("ОповещениеПослеВыбораФайлаДляЗаписи", ЭтотОбъект, Ссылка);	 
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораФайлаДляЗаписи(ВыбранныеФайлы, ДопПараметры)Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив")	Тогда

		Адрес 				= СоздатьXML(ДопПараметры);		
		двоичныеДанные 		= ПолучитьИзВременногоХранилища(Адрес);
		ПолныйПутьКФайлу 	= ВыбранныеФайлы[0];

		двоичныеДанные.Записать(ПолныйПутьКФайлу);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция СоздатьXML(Ссылка) Экспорт
 
	Путь 	= ПолучитьИмяВременногоФайла();
	Запись 	= Новый ЗаписьXML;

	Запись.ОткрытьФайл(Путь, "UTF-8"); 
	Запись.ЗаписатьОбъявлениеXML();	
	
	// Начало <!--Выгрузка элементов справочника-->
	Запись.ЗаписатьНачалоЭлемента("Compositions");
			
		Запись.ЗаписатьНачалоЭлемента("name");
			Запись.ЗаписатьАтрибут("paramName", "Наименование");
			Запись.ЗаписатьТекст(Ссылка.Наименование);
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("connection");
		    Запись.ЗаписатьАтрибут("paramName", "Связь");
			Запись.ЗаписатьТекст(Ссылка.Связь.Наименование);
		Запись.ЗаписатьКонецЭлемента();

		Запись.ЗаписатьНачалоЭлемента("date");
			Запись.ЗаписатьАтрибут("paramName", "Дата");
			Запись.ЗаписатьТекст(Формат(Ссылка.Дата, "ДФ=гггг-ММ-ddThh:mm:ss; ДЛФ=DT"));
		Запись.ЗаписатьКонецЭлемента();
	
		Запись.ЗаписатьНачалоЭлемента("Author");
		    Запись.ЗаписатьАтрибут("paramName", "Автор");
			Запись.ЗаписатьТекст(Ссылка.Автор);
		Запись.ЗаписатьКонецЭлемента();

		Запись.ЗаписатьНачалоЭлемента("Help");
			Запись.ЗаписатьАтрибут("paramName", "Подсказка");
			Запись.ЗаписатьТекст(Ссылка.Подсказка);
		Запись.ЗаписатьКонецЭлемента();
		
		Запись.ЗаписатьНачалоЭлемента("Comment");
			Запись.ЗаписатьАтрибут("paramName", "Комментарий");
			Запись.ЗаписатьТекст(Ссылка.Комментарий);
		Запись.ЗаписатьКонецЭлемента();

		ИтераторТЧ = 0;
		
		Запись.ЗаписатьНачалоЭлемента("body");
		Для Каждого СтрокаДанных Из Ссылка.Тело Цикл
			Запись.ЗаписатьНачалоЭлемента("data");
			Запись.ЗаписатьАтрибут("index", Строка(ИтераторТЧ));
			
				Запись.ЗаписатьНачалоЭлемента("dataString");
					Запись.ЗаписатьАтрибут("paramName", "СтрокаДанных");
					Запись.ЗаписатьТекст(СтрокаДанных.СтрокаДанных);
				Запись.ЗаписатьКонецЭлемента();				
				
				Запись.ЗаписатьНачалоЭлемента("Help");
					Запись.ЗаписатьАтрибут("paramName", "Подсказка");
					Запись.ЗаписатьТекст(СтрокаДанных.Подсказка);
				Запись.ЗаписатьКонецЭлемента();
				
			Запись.ЗаписатьКонецЭлемента();			
			ИтераторТЧ = ИтераторТЧ + 1;
		КонецЦикла;
		Запись.ЗаписатьКонецЭлемента();
	
	// Конец <!--Выгрузка элементов справочника-->
	Запись.ЗаписатьКонецЭлемента();

	// ЗакрытьФайл!
	Запись.Закрыть();	
	
	// Получаем двоичные данные файла и помещаем их во временное хранилище
	ДвоичныеДанные = Новый ДвоичныеДанные(Путь);
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	
	Возврат Адрес; // Возвращаем адрес файла в хранилище
	
КонецФункции
