
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СоздатьСтатистическуюКарточкуАвтора(ЭтаФорма, "ИмяАвтора1", 1);

КонецПроцедуры

&НаСервере
Процедура СоздатьСтатистическуюКарточкуАвтора(Форма, ИмяАвтора, Количество)

#Область ДобавлениеГруппыФормы	

	ИмяАвтораБезСпецСимволов 		= ОбщегоНазначенияСервер.ЗаменитьНеВалидныеСимволыВСтроке(ИмяАвтора);
	ИмяГруппыФормы					= "ГруппаФормы_" + ИмяАвтораБезСпецСимволов;
	ГруппаФормыАвтор 				= Форма.Элементы.Добавить(ИмяГруппыФормы, Тип("ГруппаФормы"), Форма);
	ГруппаФормыАвтор.Вид 			= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормыАвтор.Группировка 	= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

#КонецОбласти
	
#Область ДобавлениеРеквизитовФормы
	// Массив для новых реквизитов
	ДобавляемыеРеквизиты = Новый Массив;
		
	// Опишем ревизиты формы
	ИмяРеквизитаАвтор = "Реквизит_" + ИмяАвтораБезСпецСимволов; 

	Реквизит_Автор = Новый РеквизитФормы(
	ИмяРеквизитаАвтор,
	Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(150))
	,,
	ИмяАвтора);
		
	// Заполним массив после описания реквизитов формы
	ДобавляемыеРеквизиты.Добавить(Реквизит_Автор);
		
	// Добавим новые реквизиты в форму
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
#КонецОбласти
	
#Область ДобавлениеЭлементовФормы
	ИмяЭлемента = "Элемент_" + ИмяАвтораБезСпецСимволов;
	
	// ГруппаФормыАвтор1 - группа в которую будет помещен реквизит
	ЭлементФормы = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормыАвтор);        
	ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным = ИмяРеквизитаАвтор; //Тип строка, Объект.ИмяРеквизита или имяРеквизита если это рек. формы
#КонецОбласти
		
#Область ЗаполнениеДанных
	Форма[ИмяРеквизитаАвтор] = "Hello world"; // устанавливаем значение реквизита
#КонецОбласти

КонецПроцедуры
